bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA328.xml
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="" mask="0x10" name="PUD"/>
                    <bitfield caption="" mask="0x02" name="IVSEL"/>
                    <bitfield caption="" mask="0x01" name="IVCE"/>
                </register>
                <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
                    <bitfield caption="Sleep Mode Select Bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS2"/>
                    <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
                </register>
                <register caption="General Purpose I/O Register 2" name="GPIOR2" offset="0x4B" size="1" mask="0xFF">
                    <bitfield caption="General Purpose I/O bits" mask="0xFF" name="GPIOR2"/>
                </register>
                <register caption="General Purpose I/O Register 1" name="GPIOR1" offset="0x4A" size="1" mask="0xFF">
                    <bitfield caption="General Purpose I/O bits" mask="0xFF" name="GPIOR1"/>
                </register>
                <register caption="General Purpose I/O Register 0" name="GPIOR0" offset="0x3E" size="1" mask="0xFF">
                    <bitfield caption="General Purpose I/O bits" mask="0xFF" name="GPIOR0"/>
                </register>
            </register-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="" name="CPU_SLEEP_MODE_3BITS2">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Power Save" name="PSAVE" value="0x03"/>
                <value caption="Reserved" name="VAL_0x04" value="0x04"/>
                <value caption="Reserved" name="VAL_0x05" value="0x05"/>
                <value caption="Standby" name="STDBY" value="0x06"/>
                <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="TQFP32" caption="TQFP32">
            <pin position="1" pad="PD3"/>
            <pin position="2" pad="PD4"/>
            <pin position="3" pad="GND"/>
            <pin position="4" pad="VCC"/>
            <pin position="5" pad="GND"/>
            <pin position="6" pad="VCC"/>
            <pin position="7" pad="PB6"/>
            <pin position="8" pad="PB7"/>
            <pin position="9" pad="PD5"/>
            <pin position="10" pad="PD6"/>
            <pin position="11" pad="PD7"/>
            <pin position="12" pad="PB0"/>
            <pin position="13" pad="PB1"/>
            <pin position="14" pad="PB2"/>
            <pin position="15" pad="PB3"/>
            <pin position="16" pad="PB4"/>
            <pin position="17" pad="PB5"/>
            <pin position="18" pad="AVCC"/>
            <pin position="19" pad="ADC6"/>
            <pin position="20" pad="AREF"/>
            <pin position="21" pad="GND"/>
            <pin position="22" pad="ADC7"/>
            <pin position="23" pad="PC0"/>
            <pin position="24" pad="PC1"/>
            <pin position="25" pad="PC2"/>
            <pin position="26" pad="PC3"/>
            <pin position="27" pad="PC4"/>
            <pin position="28" pad="PC5"/>
            <pin position="29" pad="PC6"/>
            <pin position="30" pad="PD0"/>
            <pin position="31" pad="PD1"/>
            <pin position="32" pad="PD2"/>
        </pinout>
        <pinout name="QFN32" caption="QFN32">
            <pin position="1" pad="PD3"/>
            <pin position="2" pad="PD4"/>
            <pin position="3" pad="GND"/>
            <pin position="4" pad="VCC"/>
            <pin position="5" pad="GND"/>
            <pin position="6" pad="VCC"/>
            <pin position="7" pad="PB6"/>
            <pin position="8" pad="PB7"/>
            <pin position="9" pad="PD5"/>
            <pin position="10" pad="PD6"/>
            <pin position="11" pad="PD7"/>
            <pin position="12" pad="PB0"/>
            <pin position="13" pad="PB1"/>
            <pin position="14" pad="PB2"/>
            <pin position="15" pad="PB3"/>
            <pin position="16" pad="PB4"/>
            <pin position="17" pad="PB5"/>
            <pin position="18" pad="AVCC"/>
            <pin position="19" pad="ADC6"/>
            <pin position="20" pad="AREF"/>
            <pin position="21" pad="GND"/>
            <pin position="22" pad="ADC7"/>
            <pin position="23" pad="PC0"/>
            <pin position="24" pad="PC1"/>
            <pin position="25" pad="PC2"/>
            <pin position="26" pad="PC3"/>
            <pin position="27" pad="PC4"/>
            <pin position="28" pad="PC5"/>
            <pin position="29" pad="PC6"/>
            <pin position="30" pad="PD0"/>
            <pin position="31" pad="PD1"/>
            <pin position="32" pad="PD2"/>
        </pinout>
        <pinout name="QFN28" caption="QFN28">
            <pin position="1" pad="PD3"/>
            <pin position="2" pad="PD4"/>
            <pin position="3" pad="VCC"/>
            <pin position="4" pad="GND"/>
            <pin position="5" pad="PB6"/>
            <pin position="6" pad="PB7"/>
            <pin position="7" pad="PD5"/>
            <pin position="8" pad="PD6"/>
            <pin position="9" pad="PD7"/>
            <pin position="10" pad="PB0"/>
            <pin position="11" pad="PB1"/>
            <pin position="12" pad="PB2"/>
            <pin position="13" pad="PB3"/>
            <pin position="14" pad="PB4"/>
            <pin position="15" pad="PB5"/>
            <pin position="16" pad="AVCC"/>
            <pin position="17" pad="AREF"/>
            <pin position="18" pad="GND"/>
            <pin position="19" pad="PC0"/>
            <pin position="20" pad="PC1"/>
            <pin position="21" pad="PC2"/>
            <pin position="22" pad="PC3"/>
            <pin position="23" pad="PC4"/>
            <pin position="24" pad="PC5"/>
            <pin position="25" pad="PC6"/>
            <pin position="26" pad="PD0"/>
            <pin position="27" pad="PD1"/>
            <pin position="28" pad="PD2"/>
        </pinout>
        <pinout name="PDIP28" caption="PDIP28">
            <pin position="1" pad="PC6"/>
            <pin position="2" pad="PD0"/>
            <pin position="3" pad="PD1"/>
            <pin position="4" pad="PD2"/>
            <pin position="5" pad="PD3"/>
            <pin position="6" pad="PD4"/>
            <pin position="7" pad="VCC"/>
            <pin position="8" pad="GND"/>
            <pin position="9" pad="PB6"/>
            <pin position="10" pad="PB7"/>
            <pin position="11" pad="PD5"/>
            <pin position="12" pad="PD6"/>
            <pin position="13" pad="PD7"/>
            <pin position="14" pad="PB0"/>
            <pin position="15" pad="PB1"/>
            <pin position="16" pad="PB2"/>
            <pin position="17" pad="PB3"/>
            <pin position="18" pad="PB4"/>
            <pin position="19" pad="PB5"/>
            <pin position="20" pad="AVCC"/>
            <pin position="21" pad="AREF"/>
            <pin position="22" pad="GND"/>
            <pin position="23" pad="PC0"/>
            <pin position="24" pad="PC1"/>
            <pin position="25" pad="PC2"/>
            <pin position="26" pad="PC3"/>
            <pin position="27" pad="PC4"/>
            <pin position="28" pad="PC5"/>
        </pinout>
    </pinouts>
</target-description-file>
